[
  {
    "path": "posts/2021-07-17-assignment/",
    "title": "Visual Detective Assignment",
    "description": "VAST Mini Challenge 2 2021",
    "author": [
      {
        "name": "Yang Xu",
        "url": {}
      }
    ],
    "date": "2021-07-17",
    "categories": [],
    "contents": "\r\n1 Overview\r\n1.1 Background of the case\r\n1.2 Literature Review / Motivation\r\n2 Data Description and Preparation\r\nFirst of all, we need to load the necessary packages to the environment.\r\n\r\n\r\n#clear objects\r\nrm(list = ls())\r\n#load packages \r\npackages = c( 'clock','raster', 'sf', 'tmap', 'tidyverse', 'stringi', 'plotly')\r\n\r\nfor (p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  \r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\nThe datasets are loaded using read_csv. The locationMapping.csv\r\n\r\n\r\n# read data in \r\ncc <- read_csv('MC2\\\\cc_data.csv')\r\nloyalty <- read_csv('MC2\\\\loyalty_data.csv')\r\nlocationmapping <- read_csv('MC2\\\\LocationMapping.csv')\r\nglimpse(locationmapping)\r\n\r\n\r\nRows: 34\r\nColumns: 2\r\n$ Location <chr> \"Abila Airport\", \"Abila Scrapyard\", \"Abila Zacha...\r\n$ Category <chr> \"Work\", \"Work\", \"F&B\", \"Life\", \"Life\", \"F&B\", \"F...\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-25T10:33:36+08:00",
    "input_file": "assignment.knit.md"
  },
  {
    "path": "posts/2021-06-20-makeover2/",
    "title": "Dataviz Makeover 2",
    "description": "\"DataViz Makeover 1 for ISSS608: Visual Analytics\"",
    "author": [
      {
        "name": "Yang Xu",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n2.0 Alternative Design\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualization is shown below as the reference. Link from the source website\r\nIt is observed that the visualization is trying to show the top trade partners with total merchandise trade values (export + import) and also show the trade balance with Singapore.\r\nThe chart also identifies the top country with the most traded export/import by addng an icon besides it.\r\nThe blue box with words seems to show an over years changes for China and USA\r\n1.1 Clarity\r\nTo better convey the message to the audience, the visualization should be clear and direct for interpretations.\r\nFirst of all, the original design only display 2020’s trade relationship with Singapore’s major trade partners. However, the below description highlights time period not included in the visualization which causes confusion on the intent of the visualization.\r\n * The visualization itself is confusing as most of the information cannot be directly interpreted from the chart. Viewers need to go through the explanatory notes below the chart to have an understanding of the graph itself.\r\nTitle does not convey clearly the main message of the visualization.\r\nEven the shading is used to show the trade balance, however, it is hard to interpret especially with the perspective not clearly defined.\r\n1.2 Aesthetics\r\nThe color of the bubble merely identify the countries but does not add values to the visualization.\r\nThe size of the bubble is excessively big with regards to the size of the chart itself. Some of the bubbles are covered by other bubbles. Even though viewers could be able to highlight bubbles when hovering over the particular bubble, this action seems not add much meanings to the visualization.\r\nThe advantage of bubble chart is that it is able to allow visualizations of more dimensions. However, this particular design does not make full use of the bubble chart as viewers could only interpret different countries’ export, import and total trade with Singapore.\r\nThe axis element is not well labeled with units. The gif icons try to explain the perspective of the export/import, however, they are very small.\r\n2.0 Alternative Design\r\nWith the below proposed design, the aforementioned points are to be addressed. \r\nGradient of colour will be used to display the relative trade position of each partner.\r\nSize of the bubble is made smaller to ensure viewers can observe each partner clearly.\r\nTooltip is added to show details of the trade relationship and breakdown of months to reveal trend (consistently deficit/surplus or change frequently)\r\nHistogram to show the exact values of the export/import.\r\nA word board is shown at the side for viewers to quickly grab the trade positionn at one glance.\r\n3.0 Proposed Visualisation\r\nPlease view the visualization makeover on Tableau Public here.\r\n4.0 Step-by-step Guide\r\n4.1 Data Clearning and Preprocessing\r\n1. Import The dataset is in xlsx format with two tabs for import and export respectively. Use Tableau Prep builder to import the datasets and drag T1 and T2 on the pane.\r\n\r\nPivot\r\nAdd a step of pivot to the flow pane.  Select all date columns and pivot the data into a long format.  ——————————————————————————————- 3. Join\r\nAdd a join step and join T1 and T2 based on the shownw criteria. Make sure data is correctly matched. \r\n4. Cleaning\r\nPerform various data cleaning steps. + Remove repeated columns + Custom split the Country/Region into purely Country/Region and Unit\r\n\r\n+ Rename columns and change to proper role\r\n\r\nOutput to Tableau Desktop\r\nAdd a output step and choose the location and output type. Drag the output file into Tableau Desktop. ——————————————————————————————-\r\n4.2 Develop Bubble Chart\r\n1. Create Net Export to calculate the trade balance.\r\n\r\nCreate measures: Export to Singapore and Import from Singapore to split the trade value to two categories. Drag the two measures to row and column\r\n\r\n\r\n3. Drag country/region to the details ; drag trade value to size ; drag net export to colour\r\n\r\n\r\nCreate measures for tooltip:\r\nRank Measures to show the relative position of export/import\r\n\r\nCreate Tooltip graph using the shading area between export and import\r\nCreate calculated field Min Value \r\n\r\nDrag the dimensions to the rows and columns and use dual axis to draw the area graph\r\n\r\n\r\nEdit the colour of the category to change the Min Value to white colour \r\nInsert Trade Value as a trend line by dragging the trade value to the graph, use dual axis and use colour to differentiate export and import\r\n\r\n6. Create Tooltip page\r\nUse all the measures built above to realize the tooltip page which will display the breakdown of month trade balance\r\n\r\n7.Trade Position\r\nCreate a neW worksheet to display trade position Drag country/region to rows and add net export to colour\r\nMotion and Sync Filters across different pages\r\nEnable animations from Format -> Animations. Sync country/region and month-year filters across different pages\r\n\r\nDashboard\r\nCombine different pages to the same dashboard. Use the motion control on the top, the dashboard will show the changes of various perspectives. ——————————————————————————————-\r\n5.0 Derived Insights\r\nBy using the animation, we can observe the trend of Singapore’s major trade partners during 2020-2020. During the past 20 years, we can see the total trade value increases year by year.\r\nIn the early 2020s, Singapore has huge annual trade deficit with Japan. The trade deficit decreases over the year, and almost reached to a trade breakeven in 2020. This suggests Singapore’s trade advantage with Japan has improved.\r\nSingapore has always has trade surplus with Hong kong. Hong Kong has ranked as top during the past 20 years with value of imported goods from Singapore, however, Singapore imported less from Hong Kong among the major trade partners.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-20-makeover2/img/preview.png",
    "last_modified": "2021-06-21T01:54:20+08:00",
    "input_file": "makeover2.knit.md"
  },
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "Dataviz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Yang Xu",
        "url": {}
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n2.0 Alternative Design\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualization is shown below as the reference. \r\n1.1 Clarity\r\nThe title of the visualization does not convey the core idea of this visualization well to the audience. It does not highlight that the export/import of the countries are in relation to Singapore.\r\nNo proper explanatory notes are shown. First of all, from the original dataset, all data points are in thousand dollars. This important piece of information is not shown anywhere on the visualization. Secondly, no source of data is shown.\r\nTop 6 trading countries - selection criteria is not declared. After inspection, they are top trading partners of Singapore ranked by Singapore’s import volume (excluding Indonesia).\r\n\r\nY-axis scales are not synchronized. Hence, it is hard to compare and interpret the relationship between export and import as the audience cannot directly tell the trade deficit/surplus for the particular month.\r\nJust by looking at the shaded area graph, it is hard to tell the magnitude changes of the trade deficit/surplus, which is a very important aspect of the trade trend comparison.\r\nX-axis does not have a uniform time frame. Except for Japan, the rest all have 2021 shown - misleading. Japan only has 2020.\r\n1.2 Aesthetic\r\nPoor use of colours in the chart to contrast export and import. Area chart is used with shading, which is not helpful in interpreting the relationship. Both colours have a certain level of transparency set. When import and export overlap with each other, it is confusing to look at colour.\r\nAnnotations are not used to highlight message.\r\n2.0 Alternative Design\r\nTo tackle the current design problems, an alternative design is proposed. \r\n2.1 Clarity\r\nRedesign the title and subtitle to clearly convey the purpose of the visualization by mentioning this is trade data related to Singapore and explain the criteria for the countries displayed.\r\nExplanatory notes are added to the bottom of the visualization to show the units of the monetary values and the source of the dataset.\r\nAdd histogram in the visualization to show the direction and magnitude of Singapore’s trade deficit/surplus for each month\r\nAdjust the x-axis labels to ensure it is uniform across different countries and display periods only from Jan 2019 to Dec 2020\r\nThe dual axis displays net export (left) and Import/Export (right). x-axis is synchronized across each country displayed.\r\nLegend is renamed to indicate clearly the import and export from Sinapore’ perspective.\r\n2.2 Aesthetic\r\nA contrasting colour palette (blue - export from Singapore, red - import by Singapore) is used for the line chart. A gray colour is used for the histogram to display the net export field. Only the light gray colour is used for histogram, this is to avoid confusing the audience with too many colours on the graph.\r\nAdd annotations to highlight the huge change in percentage and aid in understanding.\r\nTo better fit a desktop screen display, have separated into two panels to display the 6 countries.\r\n3.0 Proposed Visualisation\r\nPlease view the visualization makeover on Tableau Public here.\r\n4.0 Step-by-step Guide\r\n4.1 Data Preprocessing\r\n1. Delete info rows from the excel sheet.\r\n\r\n\r\nImport the data into tableau.\r\n3. Pivot all columns with export/import values in the particular month for both datasets, rename the fields correctly, split the country name by the left bracket and correct the datatype of the fields.\r\n\r\nJoin the two datasets by the respective fields (country and period).\r\n\r\nCreate a calculated field ‘Net Export’ (Import - Export) to record Singapore’s trade deficit/surplus with the level of details.\r\n\r\n4.2 Dashboard Building\r\n6. Create a new sheet and drag the respective fields into the build area. Measure Values include Sum(Export) and Sum(Import).\r\n\r\nAdd filters to select country.\r\n\r\nAdd filters to select year of the period.\r\n\r\nChange the Net Export Mark Type to bar and edit colour to light gray and reduce opacity.\r\n\r\nRight click on Measure Values to check on dual axis.\r\n\r\nFix the y-axis range by right clicking on ‘Edit Axis…’ ; Rename the y-axis properly.\r\n\r\nAdd a constant reference line on y-axis to highlight the boundary for trade deficit/surplus to aid visual interpretation.\r\n\r\nCreate a calculated field to compute the percentage difference from the previous period for both export and import.\r\n\r\nAdd annotations to the specific datapoint to highlight the changes.\r\n\r\nThe visualization sheet is ready.\r\n\r\nFor better visualization purposes, split into two panels and use dashboard to display the graph.\r\n\r\nRename the aliases for the measure names to show information from Singapore’s perspective, easier for readers to understand.\r\n\r\n\r\nAdd notes at the bottom of the dashboard.\r\n\r\nCreate a proper header for the visualization.\r\n\r\n5.0 Derived Insights\r\n5.1 Largest Trade Surpluses and Deficits\r\nAmong Singapore’s top trading partners by Export values from Singapore. We can tell that except for the US, the rest are all Asian countries.\r\nSingapore has been consistently at the trade deficit position with Taiwan in the year 2019 and 2020 with import values greater than the export values. By observing the histogram, it seems that the trade deficit was slowly climbing up in the year 2020. Taiwan is also ranked as the top pattern with Singapore incurred the highest trade surpluses in 2020.\r\n\r\nIn contrast, Singapore has been consistently at the trade surplus position with Hong Kong in the year 2019 and 2020 with import values lower than the export values. Among all the trade partners, Hong Kong contributed the most of the trade surplus in Singapore 2020 trade balances.\r\n\r\nSource\r\n5.2 Mainland China\r\nMainland China is Singapore’s top trading partner by Singapore’s export dollar values. Both import and export fluctuate largely in values with months like Feb 2019, Sep 2019, Jan 2021 and August 2020 onwards. Singapore’s export to China largely increased in Aug 2020 with a 47.71% percentage of change from the previous month. Despite the global pandemic that caused economic recessions in the early of 2020 with a sharp decrease with both export and import, the recovery in the second half of the year was strong. This shows great complementarity and stability of Singapore-China bilateral trade.\r\n\r\n5.3 Malaysia\r\n*In 2019, Singapore and Malaysia were at a close breakeven position of trade. However, in 2020, Singapore entered into a trade deficit situation with Malaysia and the gap has been widening since then.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-22-my-1st-post/img/preview.png",
    "last_modified": "2021-06-20T15:49:31+08:00",
    "input_file": "my-1st-post.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog 01",
    "description": "Welcome to our new blog, DataViz Blog 01. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T10:02:38+08:00",
    "input_file": {}
  }
]
